---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarHookType.Style
source: html/3a223d55-0f7e-aa63-7314-e8ad1cd525c9.htm
---
# Autodesk.Revit.DB.Structure.RebarHookType.Style Property

The hook may only be applied to shapes of the specified style.

## Syntax (C#)
```csharp
public RebarStyle Style { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration